Repository: asciid/rum
Catalog: service/po/[.1.po
Languages: ru_ru

source: September 2019
ru_ru: Сентябрь 2019

source: User Commands
ru_ru: Команды пользователей

source: NAME
ru_ru: НАЗВАНИЕ

source: test - check file types and compare values
ru_ru: test - проверка типа файла и сравнение значений

source: SYNOPSIS
ru_ru: ОБЗОР

source: B<test> I<EXPRESSION>
ru_ru: B<test> I<ВЫРАЖЕНИЕ>

source: B<[\&> I<EXPRESSION> B<]\&>
ru_ru: B<[\&> I<ВЫРАЖЕНИЕ> B<]\&>

source: B<[\&> I<OPTION>
ru_ru: B<[\&> I<ПАРАМЕТР>

source: DESCRIPTION
ru_ru: ОПИСАНИЕ

source: Exit with the status determined by EXPRESSION.
ru_ru: Завершение со статусом, определённым ВЫРАЖЕНИЕМ.

source: display this help and exit
ru_ru: вывод этого сообщения и выход

source: output version information and exit
ru_ru: вывод информации о версии и выход

source: An omitted EXPRESSION defaults to false. Otherwise, EXPRESSION is true or false and sets exit status. It is one of:
ru_ru: Неуказанное ВЫРАЖЕНИЕ по умолчанию ложно. Иначе ВЫРАЖЕНИЕ верно или ложно и задаёт статус завершения. Оно может иметь следующий вид:

source: ( EXPRESSION )
ru_ru: ( ВЫРАЖЕНИЕ )

source: EXPRESSION is true
ru_ru: ВЫРАЖЕНИЕ верно

source: ! EXPRESSION
ru_ru: ! ВЫРАЖЕНИЕ

source: EXPRESSION is false
ru_ru: ВЫРАЖЕНИЕ ложно

source: EXPRESSION1 B<-a> EXPRESSION2
ru_ru: ВЫРАЖЕНИЕ1 B<-a> ВЫРАЖЕНИЕ2

source: both EXPRESSION1 and EXPRESSION2 are true
ru_ru: ВЫРАЖЕНИЕ1 и ВЫРАЖЕНИЕ2 верны

source: EXPRESSION1 B<-o> EXPRESSION2
ru_ru: ВЫРАЖЕНИЕ1 B<-o> ВЫРАЖЕНИЕ2

source: either EXPRESSION1 or EXPRESSION2 is true
ru_ru: верно или ВЫРАЖЕНИЕ1, или ВЫРАЖЕНИЕ2

source: B<-n> STRING
ru_ru: B<-n> СТРОКА

source: the length of STRING is nonzero
ru_ru: длина СТРОКИ не равна нулю

source: equivalent to B<-n> STRING
ru_ru: равнозначно B<-n> СТРОКА

source: the length of STRING is zero
ru_ru: длина СТРОКИ равняется нулю

source: STRING1 = STRING2
ru_ru: СТРОКА1 = СТРОКА2

source: the strings are equal
ru_ru: строки равны

source: STRING1 != STRING2
ru_ru: СТРОКА1 != СТРОКА2

source: the strings are not equal
ru_ru: строки не равны

source: INTEGER1 B<-eq> INTEGER2
ru_ru: ЧИСЛО1 B<-eq> ЧИСЛО2

source: INTEGER1 is equal to INTEGER2
ru_ru: ЧИСЛО1 равно ЧИСЛУ2

source: INTEGER1 B<-ge> INTEGER2
ru_ru: ЧИСЛО1 B<-ge> ЧИСЛО2

source: INTEGER1 is greater than or equal to INTEGER2
ru_ru: ЧИСЛО1 больше или равно ЧИСЛУ2

source: INTEGER1 B<-gt> INTEGER2
ru_ru: ЧИСЛО1 B<-gt> ЧИСЛО2

source: INTEGER1 is greater than INTEGER2
ru_ru: ЧИСЛО1 больше ЧИСЛА2

source: INTEGER1 B<-le> INTEGER2
ru_ru: ЧИСЛО1 B<-le> ЧИСЛО2

source: INTEGER1 is less than or equal to INTEGER2
ru_ru: ЧИСЛО1 меньше или равно ЧИСЛУ2

source: INTEGER1 B<-lt> INTEGER2
ru_ru: ЧИСЛО1 B<-lt> ЧИСЛО2

source: INTEGER1 is less than INTEGER2
ru_ru: ЧИСЛО1 меньше ЧИСЛА2

source: INTEGER1 B<-ne> INTEGER2
ru_ru: ЧИСЛО1 B<-ne> ЧИСЛО2

source: INTEGER1 is not equal to INTEGER2
ru_ru: ЧИСЛО1 не равно ЧИСЛУ2

source: FILE1 B<-ef> FILE2
ru_ru: ФАЙЛ1 B<-ef> ФАЙЛ2

source: FILE1 and FILE2 have the same device and inode numbers
ru_ru: ФАЙЛ1 и ФАЙЛ1 имеют схожее устройство и индексный дескриптор (inode)

source: FILE1 B<-nt> FILE2
ru_ru: ФАЙЛ1 B<-nt> ФАЙЛ2

source: FILE1 is newer (modification date) than FILE2
ru_ru: ФАЙЛ1 новее (по дате изменения) ФАЙЛА2

source: FILE1 B<-ot> FILE2
ru_ru: ФАЙЛ1 B<-ot> ФАЙЛ2

source: FILE1 is older than FILE2
ru_ru: ФАЙЛ1 старше ФАЙЛА2

source: B<-b> FILE
ru_ru: B<-b> ФАЙЛ

source: FILE exists and is block special
ru_ru: ФАЙЛ существует и является блочным

source: B<-c> FILE
ru_ru: B<-c> ФАЙЛ

source: FILE exists and is character special
ru_ru: ФАЙЛ существует и является символьным

source: B<-d> FILE
ru_ru: B<-d> ФАЙЛ

source: FILE exists and is a directory
ru_ru: ФАЙЛ существует и является каталогом

source: B<-e> FILE
ru_ru: B<-e> ФАЙЛ

source: FILE exists
ru_ru: ФАЙЛ существует

source: B<-f> FILE
ru_ru: B<-f> ФАЙЛ

source: FILE exists and is a regular file
ru_ru: ФАЙЛ существует и является обычным файлом

source: B<-g> FILE
ru_ru: B<-g> ФАЙЛ

source: FILE exists and is set-group-ID
ru_ru: ФАЙЛ существует и на нём установлен флаг setgid

source: B<-G> FILE
ru_ru: B<-G> ФАЙЛ

source: FILE exists and is owned by the effective group ID
ru_ru: ФАЙЛ существует и им владеет действующий GID

source: B<-h> FILE
ru_ru: B<-h> ФАЙЛ

source: FILE exists and is a symbolic link (same as B<-L>)
ru_ru: ФАЙЛ существует и является символической ссылкой (равнозначно B<-L>)

source: B<-k> FILE
ru_ru: B<-k> ФАЙЛ

source: FILE exists and has its sticky bit set
ru_ru: ФАЙЛ существует и на нём установлен бит sticky

source: B<-L> FILE
ru_ru: B<-L> ФАЙЛ

source: FILE exists and is a symbolic link (same as B<-h>)
ru_ru: ФАЙЛ существует и является символической ссылкой (равнозначно B<-h>)

source: B<-O> FILE
ru_ru: B<-O> ФАЙЛ

source: FILE exists and is owned by the effective user ID
ru_ru: ФАЙЛ существует и им владеет текущий UID

source: B<-p> FILE
ru_ru: B<-p> ФАЙЛ

source: FILE exists and is a named pipe
ru_ru: ФАЙЛ существует и является именованным каналом

source: B<-r> FILE
ru_ru: B<-r> ФАЙЛ

source: FILE exists and read permission is granted
ru_ru: ФАЙЛ существует и доступен для чтения

source: B<-s> FILE
ru_ru: B<-s> ФАЙЛ

source: FILE exists and has a size greater than zero
ru_ru: ФАЙЛ существует и по размеру больше нуля

source: B<-S> FILE
ru_ru: B<-S> ФАЙЛ

source: FILE exists and is a socket
ru_ru: ФАЙЛ существует и является сокетом

source: file descriptor FD is opened on a terminal
ru_ru: файловый дескриптор FD открыт в терминале

source: B<-u> FILE
ru_ru: B<-u> ФАЙЛ

source: FILE exists and its set-user-ID bit is set
ru_ru: ФАЙЛ существует и на нём установлен флаг setuid

source: B<-w> FILE
ru_ru: B<-w> ФАЙЛ

source: FILE exists and write permission is granted
ru_ru: ФАЙЛ существует и доступен для записи

source: B<-x> FILE
ru_ru: B<-x> ФАЙЛ

source: FILE exists and execute (or search) permission is granted
ru_ru: ФАЙЛ существует и доступен для исполнения (или поиска)

source: Except for B<-h> and B<-L>, all FILE-related tests dereference symbolic links. Beware that parentheses need to be escaped (e.g., by backslashes) for shells. INTEGER may also be B<-l> STRING, which evaluates to the length of STRING.
ru_ru: За исключением B<-h> и B<-L> все проверки, которые относятся к файлам, переходят по символическим ссылкам. Помните, что круглые скобки необходимо экранировать (обратной косой чертой) для оболочки командной строки. ЧИСЛО может быть B<-l> СТРОКОЙ, что означает длину строки.

source: NOTE: Binary B<-a> and B<-o> are inherently ambiguous. Use 'test EXPR1 && test EXPR2' or 'test EXPR1 || test EXPR2' instead.
ru_ru: ВНИМАНИЕ: B<-a> и B<-o> по своей сути неоднозначны. Вместо них используйте 'test ВЫРАЖЕНИЕ1 && test ВЫРАЖЕНИЕ2' или 'test ВЫРАЖЕНИЕ1 || test ВЫРАЖЕНИЕ2'.

source: NOTE: [ honors the B<--help> and B<--version> options, but test does not. test treats each of those as it treats any other nonempty STRING.
ru_ru: ВНИМАНИЕ: [ учитывает параметры B<--help> и B<--version>, в то время как для test это, как и вообще всё - непустая СТРОКА.

source: NOTE: your shell may have its own version of test and/or [, which usually supersedes the version described here. Please refer to your shell's documentation for details about the options it supports.
ru_ru: ВНИМАНИЕ: в вашу оболочку командной строки может быть встроена своя версия test и/или [, обычно заменяющая описанную здесь. Обратитесь к документации вашей оболочки за информацией о поддерживаемых [ параметрах.

source: AUTHOR
ru_ru: АВТОР

source: Written by Kevin Braunsdorf and Matthew Bradburn.
ru_ru: Написано Kevin Braunsdorf и Matthew Bradburn.

source: REPORTING BUGS
ru_ru: СООБЩЕНИЕ ОБ ОШИБКАХ

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
ru_ru: Онлайн-помощь GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report [ translation bugs to E<lt>https://translationproject.org/team/E<gt>
ru_ru: Сообщение об ошибках перевода [: E<lt>https://translationproject.org/team/E<gt>

source: COPYRIGHT
ru_ru: АВТОРСКОЕ ПРАВО

source: SEE ALSO
ru_ru: СМОТРИТЕ ТАКЖЕ

source: Full documentation at: E<lt>https://www.gnu.org/software/coreutils/[E<gt>
ru_ru: Полная документация: E<lt>https://www.gnu.org/software/coreutils/[E<gt>

source: or available locally via: info \(aq(coreutils) test invocation\(aq
ru_ru: или локальная копия командой: info \(aq(coreutils) test invocation\(aq
