Repository: asciid/rum
Catalog: service/po/po2csv.1.po
Languages: ru_ru

source: po2csv
ru_ru: PO2SCV

source: NAME
ru_ru: НАЗВАНИЕ

source: po2csv - Convert Gettext PO localization files to Comma-Separated Value (.csv) files.
ru_ru: po2csv - перевод PO-файлов локализации в файлы формата CSV.

source: SYNOPSIS
ru_ru: ОБЗОР

source: B<po2csv >[B<--version>]B< >[B<-h>|B<--help>]B< >[B<--manpage>]B< >[B<--progress >I<PROGRESS>]B< >[B<--errorlevel >I<ERRORLEVEL>]B< >[B<-i>|B<--input>]B< >I<INPUT>B< >[B<-x>|B<--exclude >I<EXCLUDE>]B< >[B<-o>|B<--output>]B< >I<OUTPUT>B< >[B<-S>|B<--timestamp>]B< >[B<--columnorder>]
ru_ru: B<po2csv >[B<--version>]B< >[B<-h>|B<--help>]B< >[B<--manpage>]B< >[B<--progress >I<ПРОГРЕСС>]B< >[B<--errorlevel >I<УРОВЕНЬ>]B< >[B<-i>|B<--input>]B< >I<ВВОД>B< >[B<-x>|B<--exclude >I<ИСКЛЮЧЕНИЕ>]B< >[B<-o>|B<--output>]B< >I<ВЫВОД>B< >[B<-S>|B<--timestamp>]B< >[B<--columnorder>]

source: DESCRIPTION
ru_ru: ОПИСАНИЕ

source: See: http://docs.translatehouse.org/projects/translate-toolkit/en/latest/commands/csv2po.html for examples and usage instructions.
ru_ru: За примерами и руководством к использованию обратитесь к документации: http://docs.translatehouse.org/projects/translate-toolkit/en/latest/commands/csv2po.html

source: OPTIONS
ru_ru: ПАРАМЕТРЫ

source: show program's version number and exit
ru_ru: вывод информации о версии программы и выход

source: show this help message and exit
ru_ru: вывод этого сообщения и выход

source: output a manpage based on the help
ru_ru: вывод man-страницы на основе сообщения помощи

source: show progress as: dots, none, bar, names, verbose
ru_ru: вывод прогресса в следующих видах: точки (dots), ничего (none), полоса (bar), названия (names), подробно (verbose)

source: show errorlevel as: none, message, exception, traceback
ru_ru: вывод сообщений об ошибках на следующих уровнях: никак (none), сообщения (message), исключения (message), отладка (traceback)

source: read from INPUT in po, pot formats
ru_ru: чтение из ВВОДА в форматы PO или POT

source: exclude names matching EXCLUDE from input paths
ru_ru: исключение НАЗВАНИЙ, подходящих под ИСКЛЮЧЕНИЕ, из путей ввода

source: write to OUTPUT in csv format
ru_ru: запись ВЫВОДА в формат CSV

source: skip conversion if the output file has newer timestamp
ru_ru: остановить перевод, если файл для вывода новее по временному штампу

source: specify the order and position of columns (location,source,target)
ru_ru: указание порядка и количества столбцов (location, source, target)
