Repository: asciid/rum
Catalog: service/po/uname.1.po
Languages: ru_ru

source: September 2019
ru_ru: Сентябрь 2019

source: User Commands
ru_ru: Команды пользователей

source: NAME
ru_ru: НАЗВАНИЕ

source: uname - print system information
ru_ru: uname - вывод системной информации

source: SYNOPSIS
ru_ru: ОБЗОР

source: B<uname> [I<\,OPTION\/>]...
ru_ru: B<uname> [I<\,ПАРАМЕТР\/>]...

source: DESCRIPTION
ru_ru: ОПИСАНИЕ

source: Print certain system information. With no OPTION, same as B<-s>.
ru_ru: Вывод определённой информации о системе. Без указанного ПАРАМЕТРА вывод схож с выводом B<-s>.

source: print all information, in the following order, except omit B<-p> and B<-i> if unknown:
ru_ru: вывод всей информации в следующем порядке кроме опущенных B<-p> and B<-i>, если они неизвестны:

source: print the kernel name
ru_ru: вывод названия ядра

source: print the network node hostname
ru_ru: вывод имени хоста сетевой ноды

source: print the kernel release
ru_ru: вывод выпуска ядра

source: print the kernel version
ru_ru: вывод версии ядра

source: print the machine hardware name
ru_ru: вывод названия аппаратуры устройства

source: print the processor type (non-portable)
ru_ru: вывод типа процессора (не портируется)

source: print the hardware platform (non-portable)
ru_ru: вывод аппаратной платформы (не портируется)

source: print the operating system
ru_ru: вывод операционной системы

source: display this help and exit
ru_ru: вывод этого сообщения и выход

source: output version information and exit
ru_ru: вывод информации о версии и выход

source: AUTHOR
ru_ru: АВТОР

source: Written by David MacKenzie.
ru_ru: Написано David MacKenzie.

source: REPORTING BUGS
ru_ru: СООБЩЕНИЕ ОБ ОШИБКАХ

source: GNU coreutils online help: E<lt>https://www.gnu.org/software/coreutils/E<gt>
ru_ru: Онлайн-помощь GNU coreutils: E<lt>https://www.gnu.org/software/coreutils/E<gt>

source: Report uname translation bugs to E<lt>https://translationproject.org/team/E<gt>
ru_ru: Сообщение об ошибках перевода uname: E<lt>https://translationproject.org/team/E<gt>

source: COPYRIGHT
ru_ru: АВТОРСКОЕ ПРАВО

source: SEE ALSO
ru_ru: СМОТРИТЕ ТАКЖЕ

source: Full documentation at: E<lt>https://www.gnu.org/software/coreutils/unameE<gt>
ru_ru: Полная документация: E<lt>https://www.gnu.org/software/coreutils/unameE<gt>

source: or available locally via: info \(aq(coreutils) uname invocation\(aq
ru_ru: или локальная копия командой: info \(aq(coreutils) uname invocation\(aq
