Repository: asciid/rum
Catalog: service/po/vym.1.po
Languages: ru_ru

source: August 5, 2005
ru_ru: 5 августа 2005

source: NAME
ru_ru: НАЗВАНИЕ

source: SYNOPSIS
ru_ru: ОБЗОР

source: DESCRIPTION
ru_ru: ОПИСАНИЕ

source: This manual page documents briefly the B<vym> program
ru_ru: Данная страница кратко описывает программу B<vym>

source: B<vym> is a program that makes mindmapping possible. It is based on qt and it can be used by everyone for structure work.
ru_ru: B<vym> позволяет строить интеллект-карты. Она написана на qt, и каждый может использовать её для структуризации работы

source: OPTIONS
ru_ru: ПАРАМЕТРЫ

source: For more information, see /usr/share/vym/doc/vym.pdf .
ru_ru: За дополнительной информацией обратитесь к /usr/share/vym/doc/vym.pdf

source: Show a small help.
ru_ru: вывод сообщения с помощью и выход.

source: Show version of vym.
ru_ru: Вывод версии vym.

source: AUTHOR
ru_ru: АВТОР

source: vym was written by E<lt>Uwe DrechslerE<gt>.
ru_ru: Написано E<lt>Uwe DrechslerE<gt>.

source: This manual page was written by Steffen Joeris E<lt>steffen.joeris@skolelinux.deE<gt>, for the Debian project (but may be used by others).
ru_ru: Данное руководство написано Steffen Joeris E<lt>steffen.joeris@skolelinux.deE<gt> для Debian (но доступно всем)
